@extends('master')

@section('title')
	Generate Number

@endsection

@section('content')
<script type="text/javascript">
	var userData = [
		"	ภทรษร อยู่สิงห์โต	",
		"	ณัฎ์ฐริกา วชิรรัตนวงศ์	",
		"	ฐาปนิษฐ์  เพชรบุญ	",
		"	ฉัตรชัย ประเสริฐสังข์	",
		"	จีรายุส ชัยศิริเลิศ	",
		"	กมลชนก ทวีขำ	",
		"	น.ส.ธัญวรัตน์ ดั่งวัน 	",
		"	เขมจิรา โกมลฐิตินันท์	",
		"	ธันยพัต วริศภูริวัฒน์	",
		"	สุรวดี ไตรสุวรรณ์	",
		"	นัจฉรีพร จันทยุทธ	",
		"	นางสาว ปภาวรินท์  ชวนะรักษ์	",
		"	เกื้อกูล แซ่อิ่ว	",
		"	ธัญญารัตน์ เรืองรุ่ง	",
		"	น.ส.ณัฐชยา เนตรพราว	",
		"	ชนิสรา ลิ้มรัตนกุล	",
		"	ตรียาภรณ์ เข็มพิลา	",
		"	จิรวรรณ สมสอางค์	",
		"	ด.ญ. ชนารัญช์ ศิริสวัสดิ์	",
		"	คคนาง พันธุวัฒน์	",
		"	ปาณิศา สยามรัฐ	",
		"	พรรษชล เขียววรรณ	",
		"	สุภารัตน์ สีวะธรรม	",
		"	อชิตะ นฤมิตร	",
		"	ธัญวรัตน์ ส่องแสงจินดา	",
		"	อินท์ขวัญ จันทร์ศรีเกษร	",
		"	รัตนากร ประจงกิจ	",
		"	ณัฐพิชฌา บุญเสริม	",
		"	ศุภัทรศิลป์ ไชยสุวรรณ์	",
		"	กรกมล ชมศรี	",
		"	ณิชกุล ทองทา	",
		"	นางสาวแพรเมือง ยาถี	",
		"	Kunanya Keawpitak	",
		"	ด.ญ.กรติกา ชินบุตร	",
		"	ณิชนันท์ พันธุมาลา	",
		"	มารีน่า เดชปรียาวดี	",
		"	ทิพวรรณ  มีพงษ์	",
		"	กานต์กมล ทิพย์ประดิษฐ์กุล	",
		"	ด.ญ.วิชุตา ขันธ์แก้ว	",
		"	สุภาวดี  พิษนุย	",
		"	นัชชา จำแนกมิตร	",
		"	อภิชญา ฮะสุน	",
		"	กัลยรัตน์ จงวัฒนไพบูลย์	",
		"	เมลดา เชนวรรณกิจ	",
		"	วรารี ทรัพย์ร่มเย็น	",
		"	กชกร ไชยวัง	",
		"	มนัสนันท์ โยคาพจร	",
		"	ปฐวพร อดุลวัฒนะ	",
		"	ปารีณา ตัน สิทธิรัตน์	",
		"	มัชฌิมา ธีรวุฒิ	",
		"	กัญณรัช ชลามาตย์	",
		"	กตยา ศรีบุตรตา	",
		"	ไอลดา ปิติสานต์	",
		"	ขวิศา หิรัญธนานนท์	",
		"	Sunisa Wanchan	",
		"	ภูวดล เริงรัตน์	",
		"	นาลินท์สิริ วงค์ปริยากร	",
		"	ฐิติชญา สีสังวาลย์	",
		"	นาย พิษณุ โสระสิงห์	",
		"	ฐิติรัตน์ จันทิหล้า	",
		"	ธันย์สิตา ธนากุลชัยวัฒน์	",
		"	พิขขาพร โพธิธาตุ	",
		"	สรัลชนา กัลชาญสุพรรณ	",
		"	ณิยะดา ดำเกาะ	",
		"	วิสาขา ศรีสุข	",
		"	ณิชา พงษ์ธนาคม	",
		"	ฐิติชญา ภู่มาศ	",
		"	น.ส.โชติกา วงศ์เอี่ยม	",
		"	พรรษชล พละกลาง	",
		"	กนกวรรณ  เจือกโว้น	",
		"	บุลภรณ์ แสงตะคุ	",
		"	ธรรมพร เจริญวรวงศ์	",
		"	ธาวินี ศุภจรูญวงศ์	",
		"	ปุณยาพร นครังกุล	",
		"	ศศิกานต์ ศรีระสันต์	",
		"	พัทธนันท์   สารานพกุล	",
		"	น.ส.สุธาสินี แสงสวัสดิ์	",
		"	ชนิภา ชัยศักดิ์กรีนนท์	",
		"	กฤติกา ยกฉวี	",
		"	ชนกนันท์ พิทักษ์นราธรรม	",
		"	ฐาปนี  เนตรสูงเนิน	",
		"	ธัญนิภา ธัญเกยูร	",
		"	ณัฐณิชา จิตต์ซื่อ	",
		"	ธันยชนก ท่นไชย	",
		"	จุฑามาศ อัคฮาด	",
		"	ธนภรณ์ คล้ายแก้ว	",
		"	สิริยากร ภูริเกียรติ	",
		"	สันฤทัย เพียรเพชร	",
		"	นาถนฎา บุตรพุฒ	",
		"	กนกพร อมรดารารัตน์	",
		"	สุรัตนา อมรดารารัตน์	",
		"	นภัสสร จารุจารีต	",
		"	วริศรา เพียราษฎร์	",
		"	จอมฉัตร ดวงสว่าง	",
		"	เมืองฟ้า บุษมาโร	",
		"	เบญญาสิริ ประเสริฐรุ่งเรือง	",
		"	วาสินี รัตนกมุท	",
		"	ปิ่นธิดา พัฒนศรี	",
		"	แพรวา สุธรรมพงษ์	",
		"	ขงัญมนัส กุศล	",
		"	ปุณญตศ์ โตวิชยธำรง	",
		"	นัฏชา เชื้อรังสรรค์	",
		"	ณัฐพร คงสักบัน	",
		"	ณัฐภัทร ถมปัด	",
		"	น.ส.นริศรา  ชาตะวราหะ	",
		"	ธิติสุดา  ปักษาวรรณ	",
		"	สุริยภัทร สุโนภักดิ์	",
		"	รวินท์นิภา พันธุ์พานิช	",
		"	กิตติยา มโหสถนันทน์	",
		"	กัลยกร พงษ์ภีระยานันท์	",
		"	กุลธิดา วรนาม	",
		"	ธิดารัตน์ ศรีสุภัคพร	",
		"	ยาตรมณี บุญฟัก	",
		"	อารี ธนะภูมิชัย 	",
		"	ปัญกร แฟงสวัสดิ์	",
		"	วาทิตา เกิดมณี	",
		"	รัสชญา เปรมสุวรรณ	",
		"	อภิญญา สุวรรณทศ	",
		"	ยุวธิดา มานะดี	",
		"	ปิยะพงษ์ อินเจริญ	",
		"	ณัฐพิมล โชคดีนิรันดร์	",
		"	วิยะดา กลั่นเมฆ	",
		"	ภัชธีรา  ทาระนัด	",
		"	ศุภกิจ สูนพลอย	",
		"	จิรานันท์ ขันอาสา	",
		"	เกศสกานต์ ใจจันทร์	",
		"	พัชรินทร์ จันทร์กลิ่น	",
		"	ภัทรธร เทียนประเสริฐ	",
		"	นางสาวกมลลักษณ์ ธนประเสริฐสกุล	",
		"	ณัฐณิชา อึงไพบูลย์กิจ	",
		"	ด.ญ.ธันยพร ลิ้มวงศ์รุจิรัตน์	",
		"	สิดาพร สัมพัดสิน	",
		"	ชนากานต์ เมฆอากาศ	",
		"	นัชชา เสนาเจริญ	",
		"	ด.ญ พัชชาภา วงศ์ศรี	",
		"	หนึ่งฤทัย เปลี่ยนบำรุง	",
		"	จีรวรรณ สุขสำราญ	",
		"	ธัชชัย เรืองธนวิชย์	",
		"	พิทยาภรณ์ ภาคกุล	",
		"	สิตานัน  เข็มเพ็ชร์	",
		"	ฉัตรพร ส่งสกุลชัย	",
		"	กนกอร ตั้งจิตเจริญกิจ	",
		"	นัฏชา เชื้อรังสรรค์	",
		"	นัฏชา เชื้อรังสรรค์	",
		"	แทนทอง พิพิธพันธ์พิพิท	",
		"	ธิวาณี ศัพท์สุวรรณ์	",
		"	นางสาว พัทธมน รัตนนิรมลสกุล	",
		"	วันวิภา สุริยอัมพร	",
		"	ศศินา รอดผึ้ง	",
		"	ปลายฝน. สุวรรณดี	",
		"	อนามิกา เพ็ชรทอง	",
		"	นางสาว จริยา คำราพิช	",
		"	น.ส.วิลาวัลย์ หาญยุทธ	",
		"	วริษา อ่อนจันทร์	",
		"	ปิยากร นะพรานบุญ	",
		"	พิรุณ แซ่ลี้	",
		"	เจนนิษา จันทร	",
		"	กชกร ช้างชู	",
		"	น.ส ปุญญาพัฒน์ วรรณถาวรเทวี	",
		"	สุมาลี พันธุ์โพธิ์	",
		"	พุทธบงกช จ้อยศรีเกตุ	",
		"	นางสาว กนกอร วิริยาชีวกิจ	",
		"	ธัญกาญจน์ เดชะรักษา	",
		"	สุรัสวดี จำวรรณ์	",
		"	สุประภา อังกินันทน์	",
		"	กัญญาภัค พยุงวงษ์	",
		"	มนสิชา จองใจอนุรักษ์	",
		"	น.ส.ภัทรรินทร์ หินซุย	",
		"	ชญานิศ จันที	",
		"	นงนภัส  คำอ้าย	",
		"	ณัฏฐณิชา  คำอ้าย	",
		"	ด.ญ ทัณฑิกา เพลินจิตร	",
		"	กมลวรรณ ร่วมเงิน	",
		"	ขัติยาภรณ์ ภูผิวนาค	",
		"	พิชชาภา ศรีสด	",
		"	ณัฐชยา มินโต๊ะสะมะ	",
		"	สิริกร ประดาศักดิ์	",
		"	ด.ญ.ศศิธร ขันแข็ง	",
		"	สุธาสินี กันยานุวัฒน์	",
		"	ปพิชญา กิจสวน	",
		"	นารีนาฏ ไชยอาม	",
		"	วสุ ติยวลีย์	",
		"	นางสาว วิรัลพัชร  สุวณิชย์	",
		"	ณิชารัศม์  ศรีพิทักษ์พล	",
		"	ด.ช.ถิรวัฒน์ พงศะทัตกิจ	",
		"	ศรีตุลา ชูชาติ	",
		"	เกวลี เดชนิติรัตน์	",
		"	สวรส สุกสุต	",
		"	กานต์ชนิต กรีพลฤกษ์	",
		"	นรภัทร เทียนทอง	",
		"	ปัณฑารีย์  ตีเหล็ก	",
		"	ฐิติญากรณ์ จิโนทา	",
		"	นภนนท์ แสงวัฒนรัตน์	",
		"	เด็กหญิงพรรษชล พันธชาติ	",
		"	เบญญาภา  ศรีสันติธรรม	",
		"	ปภาวรินท์ นาคเสน	",
		"	ตุลยดา ภคเมธาวี	",
		"	กชกร ข้างชู	",
		"	อภิญญา หิรัญ	",
		"	ด.ญ.กันต์ฤทัย ขันธบุตร	",
		"	ธัญชนก วงศ์รวิภาสกุล	",
		"	บุณยาพร สมบูรณ์สิทธิ์	",
		"	จุฑามาศ อชิระธนภูมิ	",
		"	ด.ญ.พรรณรัศมิ์ สารทรัพย์	",
		"	ธนบดี มิลินธนพัชรพร	",
		"	อัจฉริยา สุรินต๊ะ	",
		"	สิตาพร ยูปานนท์	",
		"	รวิวรรณ แก้วได้ปาน	",
		"	อริสรา สมบูรณ์	",
		"	อริยา อุทิศ	",
		"	ดรุณี เพียรพิจารณ์	",
		"	ทิพย์วิมล ตุ้มทอง	",
		"	น.ส.ศศิวิมล ธุวะคำ	",
		"	ศุภารมย์ รัตแพทย์	",
		"	สลิลดา ทัศนานุกุลกิจ	",
		"	บุญสิตา บุญเดช	",
		"	วาสินี รักษาสุธี	",
		"	กรกช เลิศสิทธิรักษ์	",
		"	น.ส.ธนวรรณ รักใคร่	",
		"	สนิษฐา  ขัดเกลา	",
		"	แพรวขวัญ รื่นอุดม	",
		"	สกุลยา สมศรี	",
		"	ธิษณา เดชพรหม	",
		"	นายพรรษสน ลีฬหาวุฒิ	",
		"	อิสริยาภรณ์  จันทร์อุดม	",
		"	นางสาว รัตนากร แสงใส	",
		"	ณัฐมน บุญพา	",
		"	เกณิกา หมั่นการนา	",
		"	น.ส ปิ่นมนัส จันทร์พลังศรี	",
		"	กัลยรัตน์ ทัดเทียม	",
		"	ชนัดดา น้าเจริญ	",
		"	บุณณดา ฤทธิบันลือ	",
		"	ธนพร เอื้อประโยชน์กุล	",
		"	พจนา นนทา	",
		"	จิราภรณ์ ศรีดี	",
		"	พิชานันท์ เหลิง	",
		"	สิริกร กล้าหาญ	",
		"	ด.ญ. บวรลักษณ์ อุดมมงคลกิจ	",
		"	ศิรประภา เสาะหาวิทย์	",
		"	ปภาพินท์ มานิตย์โชติพิสิฐ	",
		"	ด.ญ.ณัฐริกา ธรรมชนา	",
		"	ด.ญ.ดารุณี อยู่มาก	",
		"	วาริศา คุ้มคง	",
		"	ปณิดา บุญเพี้ย	",
		"	รวิสรา วงษ์วิวัฒน์	",
		"	กมลลักษณ์ นรทีทาน	",
		"	ศิรินวรา บรรเลงการ	",
		"	พิชชาภา สงวนแพง	",
		"	น.ส. ณัฐสุดา คำทุ่น	",
		"	พลอยวารี  วิชัยวงค์	",
		"	อัฐชริญา รุจีรไพบูลย์	",
		"	ฐิตาพร มณีรัตน์ประภา	",
		"	ศศินา  ทองเหลือ	",
		"	ณัฏฐนิช ศุภเสถียร	",
		"	ปภาดา เหล่าเจริญสุข	",
		"	ศุภัชฌา พงศ์พันหยก	",
		"	ด.ญ.บุณฑริกา นามวงษ์	",
		"	ด.ญ.ณัชทราพรฆ์ โชคสวัสดิ์อำนวย	",
		"	วรางค์รัตน์  วัฒนปรีดา	",
		"	ณัฐฐิกานต์ ทาสุธรรม 	",

	];

	var generated = [];

	function generate() {
		var generateNember = Math.floor(Math.random() * (159 - 0)) + 0;
		if($.inArray(generateNember,generated) != -1){
			return generate();
		}else{
			generated.push(generateNember);
			return userData[generateNember];
			
		}
		
	}


	function generateAward(){
		$('#noticeArea').html('');
		generated = [];
		var eleHtml = '<div class="row"> <div class="col-sm-6">'+
		'<div class="panel panel-primary">'+
			'<div class="panel-heading">ผู้ได้รับรางวัลชุดคอสเพลย์ไม่เกิน 200 หยวน</div>'+
			'<div class="panel-body">'+
				'<div class="row">'+
					'<div class="col-sm-6" id="award1-1">1. '+generate()+'</div>'+
					'<div class="col-sm-6" id="award1-2">2. '+generate()+'</div>'+
				'</div>'+
			'</div>'+
		'</div>'+
		'</div><div class="col-sm-6">'+
		'<div class="panel panel-warning">'+
			'<div class="panel-heading">ผู้ได้รับรางวัลวิกคอสเพลย์ไม่เกิน 70 หยวน</div>'+
			'<div class="panel-body">'+
				'<div class="row">'+
					'<div class="col-sm-6" id="award1-1">1. '+generate()+'</div>'+
					'<div class="col-sm-6" id="award1-2">2. '+generate()+'</div>'+
				'</div>'+
			'</div>'+
		'</div>'+
		'</div></div>'+
		'<div class="panel panel-default">'+
			'<div class="panel-heading">ผู้ได้รับโปสเตอร์ 50 ท่าน</div>'+
			'<div class="panel-body" >'+
				'<div class="row" id="poster">'+
					'<div class="col-sm-12" id="posterBottom"></div>'+
				'</div>'+
			'</div>'+
		'</div>';

		$('#noticeArea').html(eleHtml);

		for(var d = 0;d < 50 ; d++){
			var numberPoster = d+1;
			$('#posterBottom').append('<div class="col-sm-3" id="award1-1">'+numberPoster+'. '+generate()+'</div>');
		}
	}

</script>
<button class="btn btn-success" onclick="generateAward();$('#listArea').hide();">สุ่มจับรางวัล</button> <button class="btn btn-danger" onclick="$('#noticeArea').text('');$('#listArea').show();">Reset</button>
		<hr>
		<div id="noticeArea">
			
		</div>
		<div id="listArea">
		<div class="panel panel-info">
			<div class="panel-heading">รายชื่อผู้มีสิทธิ์ได้รับรางวัล</div>
			<div class="panel-body">
				
				<div class="row">
					
						<script type="text/javascript">
							for(var i=0;i<userData.length;i++){
								var userNember = i+1;
								document.write('<div class="col-sm-3">ที่ '+userNember+': '+userData[i]+'</div>'); 
							}
						</script>
					
				</div>
			</div>
		</div>
		</div>



@endsection